In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("/Applications/Ramos/Coding Repo/ProjectLord/venv/population_data.csv")
data.head()

           name      country      pop
0        Madrid        Spain  3255944
1         Sofia     Bulgaria  1152556
2     Rotterdam  Netherlands   598199
3        Tyumen       Russia   519119
4  Petrozavodsk       Russia   265025

In [5]:
data

<bound method NDFrame.describe of              name      country      pop
0          Madrid        Spain  3255944
1           Sofia     Bulgaria  1152556
2       Rotterdam  Netherlands   598199
3          Tyumen       Russia   519119
4    Petrozavodsk       Russia   265025
..            ...          ...      ...
495       Ryazan'       Russia   520173
496         Lille       France   228328
497   Baranovichi      Belarus   168772
498         Elche        Spain   230112
499  Novokuznetsk       Russia   539616

[500 rows x 3 columns]>

In [8]:
# Rows and Column
data.shape

(500, 3)

In [11]:

## To check object datatype
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     500 non-null    object
 1   country  500 non-null    object
 2   pop      500 non-null    int64
dtypes: int64(1), object(2)
memory usage: 11.8+ KB

In [13]:
## Basic statistics
data.describe()

                pop
count  5.000000e+02
mean   4.442422e+05
std    7.302747e+05
min    1.556190e+05
25%    1.991370e+05
50%    2.668820e+05
75%    4.393478e+05
max    1.038122e+07

In [15]:
## Set display option
pd.set_option("display.float_format", str)
data.describe()

                    pop
count             500.0
mean         444242.226
std   730274.6808888786
min            155619.0
25%            199137.0
50%            266882.0
75%           439347.75
max          10381222.0

In [18]:
## All columnes statistics
data.describe(include= "all")

          name country               pop
count      500     500             500.0
unique     500      37               NaN
top     Madrid  Russia               NaN
freq         1     126               NaN
mean       NaN     NaN        444242.226
std        NaN     NaN 730274.6808888786
min        NaN     NaN          155619.0
25%        NaN     NaN          199137.0
50%        NaN     NaN          266882.0
75%        NaN     NaN         439347.75
max        NaN     NaN        10381222.0